MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F407IE/mcu.h
    /** @brief ISTS register */
    union
    {
        __IM  uint32_t ISTS;
        struct
        {
            __IM  uint32_t RESERVED1                   : 3;
            __IM  uint32_t PMTIS                       : 1;
            __IM  uint32_t MMCIS                       : 1;
            __IM  uint32_t MMCRXIS                     : 1;
            __IM  uint32_t MMCTXIS                     : 1;
            __IM  uint32_t RESERVED2                   : 2;
            __IM  uint32_t TSIS                        : 1;
            __IM  uint32_t RESERVED3                   : 22;
        } ISTS_B;
    };

    /** @brief IMASK register */
    union
    {
        __IOM uint32_t IMASK;
        struct
        {
            __IM  uint32_t RESERVED1                   : 3;
            __IOM uint32_t PMTIM                       : 1;
            __IM  uint32_t RESERVED2                   : 5;
            __IOM uint32_t TSTIM                       : 1;
            __IM  uint32_t RESERVED3                   : 6;
        } IMASK_B;
    };

    /** @brief ADDR0H register */
    union
    {
        __IOM uint32_t ADDR0H;
        struct
        {
            __IOM uint32_t ADDR0H                      : 16;
            __IM  uint32_t RESERVED                    : 15;
            __IM  uint32_t AL1                         : 1;
        } ADDR0H_B;
    };

    /** @brief ADDR0L register */
    union
    {
        __IOM uint32_t ADDR0L;
        struct
        {
            __IOM uint32_t ADDR0L                      : 32;
        } ADDR0L_B;
    };

    /** @brief ADDR1H register */
    union
    {
        __IOM uint32_t ADDR1H;
        struct
        {
            __IOM uint32_t ADDR1H                      : 16;
            __IM  uint32_t RESERVED                    : 8;
            __IOM uint32_t MASKBCTRL                   : 6;
            __IOM uint32_t ADDRSEL                     : 1;
            __IOM uint32_t ADDREN                      : 1;
        } ADDR1H_B;
    };

    /** @brief ADDR1L register */
    union
    {
        __IOM uint32_t ADDR1L;
        struct
        {
            __IOM uint32_t ADDR1L                      : 32;
        } ADDR1L_B;
    };

    /** @brief ADDR2H register */
    union
    {
        __IOM uint32_t ADDR2H;
        struct
        {
            __IOM uint32_t ADDR2H                      : 16;
            __IM  uint32_t RESERVED                    : 8;
            __IOM uint32_t MASKBCTRL                   : 6;
            __IOM uint32_t ADDRSEL                     : 1;
            __IOM uint32_t ADDREN                      : 1;
        } ADDR2H_B;
    };

    /** @brief ADDR2L register */
    union
    {
        __IOM uint32_t ADDR2L;
        struct
        {
            __IOM uint32_t ADDR2L                      : 32;
        } ADDR2L_B;
    };

    /** @brief ADDR3H register */
    union
    {
        __IOM uint32_t ADDR3H;
        struct
        {
            __IOM uint32_t ADDR3H                      : 16;
            __IM  uint32_t RESERVED                    : 8;
            __IOM uint32_t MASKBCTRL                   : 6;
            __IOM uint32_t ADDRSEL                     : 1;
            __IOM uint32_t ADDREN                      : 1;
        } ADDR3H_B;
    };

    /** @brief ADDR3L register */
    union
    {
        __IOM uint32_t ADDR3L;
        struct
        {
            __IOM uint32_t ADDR3L                      : 32;
        } ADDR3L_B;
    };

    __IM uint32_t RESERVED2[40];
    /**
     * @brief MAC management counters (MMC)
     */
    /** Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CNTRST          : 1;
            __IOM uint32_t CNTSTOPRO       : 1;
            __IOM uint32_t RSTOR           : 1;
            __IOM uint32_t MCNTF           : 1;
            __IOM uint32_t MCNTP           : 1;
            __IOM uint32_t MCNTVALP        : 1;
            __IM  uint32_t RESERVED        : 26;
        } CTRL_B;
    } ;

    /** RX Interrupt Register */
    union
    {
        __IOM uint32_t RXINT;

        struct
        {
            __IM  uint32_t RESERVED1       : 5;
            __IM  uint32_t RXFCE           : 1;
            __IM  uint32_t RXFAE           : 1;
            __IM  uint32_t RESERVED2       : 10;
            __IM  uint32_t RXGUNF          : 1;
            __IM  uint32_t RESERVED3       : 14;
        } RXINT_B;
    } ;

    /** TX Interrupt Register */
    union
    {
        __IOM uint32_t TXINT;

        struct
        {
            __IM  uint32_t RESERVED1       : 14;
            __IM  uint32_t TXGFSCOL        : 1;
            __IM  uint32_t TXGFMCOL        : 1;
            __IM  uint32_t RESERVED2       : 5;
            __IM  uint32_t TXGF            : 1;
            __IM  uint32_t RESERVED3       : 10;
        } TXINT_B;
    } ;

    /** RX Interrupt Mask Register */
    union
    {
        __IOM uint32_t RXINTMASK;

        struct
        {
            __IM  uint32_t RESERVED1       : 5;
            __IOM uint32_t RXFCEM          : 1;
            __IOM uint32_t RXFAEM          : 1;
            __IM  uint32_t RESERVED2       : 10;
            __IOM uint32_t RXGUNFM         : 1;
            __IM  uint32_t RESERVED3       : 14;
        } RXINTMASK_B;
    } ;

    /** TX Interrupt Mask Register */
    union
    {
        __IOM uint32_t TXINTMASK;

        struct
        {
            __IM  uint32_t RESERVED1       : 14;
            __IOM uint32_t TXGFSCOLM       : 1;
            __IOM uint32_t TXGFMCOLM       : 1;
            __IM  uint32_t RESERVED2       : 5;
            __IOM uint32_t TXGFM           : 1;
            __IM  uint32_t RESERVED3       : 10;
        } TXINTMASK_B;
    } ;

    __IM  uint32_t  RESERVED3[14];

    /** TX Good Frames After a Single Collision Counter Register */
    union
    {
        __IM uint32_t TXGFSCCNT;

        struct
        {
            __IM  uint32_t TXGFSCCNT       : 32;
        } TXGFSCCNT_B;
    } ;

    /** TX Good Frames After More Than a Single Collision Counter Register */
    union
    {
        __IM uint32_t TXGFMCCNT;

        struct
        {
            __IM  uint32_t TXGFMCCNT       : 32;
        } TXGFMCCNT_B;
    } ;

